{
    "a0pp04": {
        "desc": "how can i get rid of a persistent stalker if a restraining order and even them being arrested wont stop them\n\ni'm afraid for the safety of my students, especially when the person stalking me is a former student and a minor and in Chicago you never know ",
        "subReddit": "legaladvice",
        "topComment": "Keep calling the police when they violate the order.  The police will not mind.\n\nMake sure you are protected.  If that means keeping pepper spray or a gun on you depends on what you feel keeps you safe.  ",
        "title": "I've been stalked for the past year and I don't know how to stop it"
    },
    "a0pxmh": {
        "desc": "I was leaving a Florida grocery store when a young lady plowed into my vehicle as she was crossing an intersection in the parking lot. The cops were called, and they determined she was not at fault because the grocery store failed to indicate she needed to stop. My insurance is now stating the damage to my vehicle will not be covered because no fault was assigned to anybody. I believe she is at fault for failing to look or stop before crossing an intersection. Is my only option to sue this young lady, or is there anything I can do to prove she was at fault? \n\nHere is a satellite picture of the parking lot where the accident occurred. I'm the blue line and the young lady is the red line.\n\nimgur.com/a/FEPTQJX",
        "subReddit": "legaladvice",
        "topComment": "Well what insurance company do you have?",
        "title": "Car Accident"
    },
    "a0nnmg": {
        "desc": "I’ve been declined from everywhere I’ve applied (online, in person credit unions) my credit is in the mid-low 600s. My cards are maxed, bank accounts empty. I’m still paying off my car\n\nI’m behind on bills and need a loan to cover an upcoming move (mainly security deposit + moving expenses). I would be able to pay back at least half of the loan amount in January once I get my security deposit back ($1700)\n\nI should be taking home around $70,000 this year, next year between $80-$100K\n\nI started a new job a few months ago, which was a big initial pay drop (went from $85K to $55K, however I’m in sales and have quarterly commission checks coming in 2019) and made a series of dumb choices (partying) now I’m in a pickle and my lease is up in a little over a month and I can’t renew due to a pre-arranged agreement\n\nAny advice regarding getting a loan approved would be greatly appreciated\n\nAgain, I know Ive made bad financial choices but I really need help getting out of this",
        "subReddit": "personalfinance",
        "topComment": "Weird how you can't just keep taking out debt to pay your debt",
        "title": "How can I get a personal loan for $2500-$3000 with poor credit and no assets?"
    },
    "a0nf3o": {
        "desc": "So I went fishing at my university for the first time, didn’t know I needed a license, got a ticket from NM game and fish. The ticket was 100 dollars. Got a call a today from the officer saying he wrote the wrong amount and it’s actually 110 dollars. The copy I have said 100. Do I have to pay 110?",
        "subReddit": "legaladvice",
        "topComment": "If the violation minimum or total is $110, you're going to have to pay $110. ",
        "title": "Got a ticket? Cop called, tried to change the amount?"
    },
    "a0pjtz": {
        "desc": "[US] I'm in the Navy, Active Duty and NCIS has come and collected my computer. This has been going on for months and I've not heard anything from NCIS. Today at one of my divorce court hearings on child visitation, the judge mentioned that the state/district ADA was involved. Is this normal with a military case or does it mean they possibly found something incriminating on my computer? \n\nI'll go ahead and add, I have a lawyer.  I should have asked her this question after the hearing, but it didn't dawn on me until I got home. ",
        "subReddit": "legaladvice",
        "topComment": "Our task force force frequently works cases that were started by military authorities, so the involvement of the local authorities is not conclusive here.\n\nBut if it's there (or was there) they're likely to find out.",
        "title": "Getting divorced and wife has accused me of having child porn on my computer."
    },
    "a0m831": {
        "desc": "I’m trying to justify a $400 purchase. Monthly take home is $2500 after 401k match and roth IRA contributions. Also have $7000 in savings\n\nMonthly expenses:\n\nRent: NA\n\nGroceries: NA\n\nUtilities: NA\n\nCar insurance: $100\n\nGas: $120\n\nMed bills: $280 (balance of 5.5k, 0% interest)\n\nHealth insurance: $110\n\nSpotify: $10\n\n\n\n\n\n",
        "subReddit": "personalfinance",
        "topComment": "You have $1880 left over after your monthly expenses. You could make the $400 purchase without putting much of a dent into your financial picture. I wouldn't make it a habit, though. \n\nUltimately your best bet is to think about what you could be putting that money towards by way of future financial goals, understanding the impact of being $400 further away from those goals, and then making a decision. ",
        "title": "How much fun money can i realistically afford?"
    },
    "a0oarp": {
        "desc": "Hey reddit! \n\nIs there any advice out there for refinancing student loans? My payments are coming up in the next month or so and I will probably visit a banker (Wells Fargo). Not sure if there are any other options out there for me right now. \n\nAny advice would be very much appriciated! \n\n\n",
        "subReddit": "personalfinance",
        "topComment": "You may find these links helpful:\n\n- [Student Loans](/r/personalfinance/wiki/studentloans)\n- [\"How to handle $\"](/r/personalfinance/wiki/commontopics)\n- [What's the best way to pay down my debt?](/r/personalfinance/wiki/debt#wiki_what.27s_the_best_way_to_pay_down_my_debt.3F)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/personalfinance) if you have any questions or concerns.*",
        "title": "Student Loan Refinancing advice"
    },
    "a0ltaj": {
        "desc": "He's a doctor, 75 years old, and according to him, been paying about $210/month for a couple of decades at least. After a lot of digging, I found the policies he has. I really don't know much about disability insurance and he knows even less so I figured I would start here.\n\nThe 2 policies are here:\n\n[https://imgur.com/a/qG77Yvf](https://imgur.com/a/qG77Yvf)",
        "subReddit": "personalfinance",
        "topComment": "typically, disability insurance is like income insurance. if you become disabled and because of your disability, you can't go to work and bring home money, then the disability policy kicks in. is your dad still work at 75? if so, it might make sense to continue the policy, though the benefit may be quite small due to his age. if he's not working, you'll really want to double check the benefits. it might not even be payable if he isn't employed. ",
        "title": "Appropriate disability insurance for my dad?"
    },
    "a0oa6y": {
        "desc": "[MA] To start, I’m epileptic, have been taking medicine since I was 10, but grand mals are very rare for me. \n\nI’ve been taking the generic brand for awhile now, supposed to be the same thing.\n\nI called my neurologist to get a refill, and asked it to be sent to my normal pharmacy. The woman on the phone confirmed the pharmacy with me twice, including repeating the address.\n\nShe sends it to the wrong one, one I used several years ago somehow. \n\nI take my medicine, something doesn’t feel quite right, I don’t feel as stable. I keep taking it.\n\nI then have TWO grand mal seizures, I had to be hospitalized overnight, missed a week of work, including important calls/demos with Halliburton, OshKosh Trucks, Dell, and John Deere the day it happened. I’ve  never had aftermath like this before, it was bad. Happened a full month ago and I still feel some residual effects in my shoulders (dislocated) and nose (hit my face on bathroom tile). In the past I’ve gone to work the next day. \n\nI look at my bottle and I see it’s from a different manufacturer.\n\nI read up, and formulas can vary by 30%, and the one I had been taking for years was closest to name brand. Others had similar experiences feeling that a diff manufacturer was like not taking meds at all. \n\nI managed to find name brand, and I started getting double vision for a couple days (a normal side effect with a too-high dose) because of the difference in strength from what I was dispensed and the normal medication.\n\nI luckily have phenomenal health insurance through my work so I don’t believe I’ll end up having to pay a dime even with the hospital ride (first one happened at my house, I went to the community health center near my house, they sent me to the hospital in an ambulance. Had the second at the hospital) \n\nIs there something I should do about this? Is it my fault for not noticing it was a different manufacturer? I feel like it’s not ok to send to the wrong pharmacy then receive a diff version without being told. Even when I used to pick up there, it was my correct version. When the tablet changed shape there was even a notification on my bottle.\n\nTldr: nurse sent script to wrong pharmacy, diff manufacturer on meds without being told, had two grand mal seizures \n\n\n\n",
        "subReddit": "legaladvice",
        "topComment": "---\r\n> http://imgur.com/a/myIAb\r\n\r\n---\r\n*I am a bot whose sole purpose is to improve the timeliness and accuracy of responses in this subreddit.*\r\n\r\n---\r\n**It appears you forgot to include your location in the title or body of your post. Please update the body of your original post to include this information.**\r\n\r\n---\r\n***Do NOT delete this post - Instead, simply edit the post with the requested information.***\r\n\r\n---\r\n\r\nAuthor: /u/arieljoc\r\n\r\nTitle: **Had a seizure with a surprise medication change**\r\n\r\nOriginal Post: \r\n\r\n> To start, I’m epileptic, have been taking medicine since I was 10, but grand mals are very rare for me. \n> \n> I’ve been taking the generic brand for awhile now, supposed to be the same thing.\n> \n> I called my neurologist to get a refill, and asked it to be sent to my normal pharmacy. The woman on the phone confirmed the pharmacy with me twice, including repeating the address.\n> \n> She sends it to the wrong one, one I used several years ago somehow. \n> \n> I take my medicine, something doesn’t feel quite right, I don’t feel as stable. I keep taking it.\n> \n> I then have TWO grand mal seizures, I had to be hospitalized overnight, missed a week of work. I’ve never had aftermath like this before, it was bad. Happened a full month ago and I still feel some residual effects. In the past I’ve gone to work the next day. \n> \n> I look at my bottle and I see it’s from a different manufacturer.\n> \n> I read up, and formulas can vary by 30%, and the one I had been taking for years was closest to name brand. Others had similar experiences feeling that a diff manufacturer was like not taking meds at all. \n> \n> I managed to find name brand, and I started getting double vision for a couple days (a normal side effect with a too-high dose) because of the difference in strength from what I was dispensed and the normal medication.\n> \n> I luckily have phenomenal health insurance through my work so I don’t believe I’ll end up having to pay a dime even with the hospital ride (first one happened at my house, I went to the community health center near my house, they sent me to the hospital in an ambulance. Had the second at the hospital) \n> \n> Is there something I should do about this? Is it my fault for not noticing it was a different manufacturer? I feel like it’s not ok to send to the wrong pharmacy then receive a diff version without being told. Even when I used to pick up there, it was my correct version. When the tablet changed shape there was even a notification on my bottle.\n> \n> Tldr: nurse sent script to wrong pharmacy, diff manufacturer without being told, had two grand mal seizures \n> \n> \n> \n> \r\n\r\n\r\n\r\n\r\n---\r\nLocationBot 4.300172817 | GitHub (Coming Soon) | [Statistics](https://locationbot.info) | [Report Issues](https://www.reddit.com/r/locationbot)",
        "title": "Had a seizure with a surprise medication change"
    },
    "a0ps6b": {
        "desc": "My friends and I are creating an llc to start an edibles company when our state legalizes. Originally it was going to be 3 of us, each with a 1/3 stake in the company. I’m the chef, and not that business savvy. One friend, we’ll call him Josh, wants to bring his father and his best friend in as equal partners. He has convinced Alex, the other friend that this is a good idea by using the dad & best friend’s finances as a lure. I’m finding this to be suspicious behavior because, it seems like Josh will effectively have power over 60% of the company if this is split equal ways with 5 people. We have investors, and I don’t find it necessary to have people with money become actual partners in the company. When I brought this up to Alex and Josh, they collectively try to convince me otherwise but I’m still not seeing their point of view. They have since tried to sweeten the deal for me by saying they’ll give me 25% and I’ll be the top shareholder. With the numbers they’ve thrown at me, Josh”s family will still control 55%. I’ve paid $2500 to our legal team to draw up the llc paperwork, and I’ve signed a legal services agreement. I have not signed any other paperwork. Can I just back out and wash my hands clean of this? Can I expect to lose out on my $2500? If I choose to go through with this, is there anything I can put in our paperwork that will prevent them from stealing my recipes and giving me the boot?",
        "subReddit": "legaladvice",
        "topComment": "---\r\n> http://imgur.com/a/myIAb\r\n\r\n---\r\n*I am a bot whose sole purpose is to improve the timeliness and accuracy of responses in this subreddit.*\r\n\r\n---\r\n**It appears you forgot to include your location in the title or body of your post. Please update the body of your original post to include this information.**\r\n\r\n---\r\n***Do NOT delete this post - Instead, simply edit the post with the requested information.***\r\n\r\n---\r\n\r\nAuthor: /u/snakespit\r\n\r\nTitle: **I’ve paid a retainer to a lawyer to start an llc with 4 people and now I’m having second thoughts.**\r\n\r\nOriginal Post: \r\n\r\n> My friends and I are creating an llc to start an edibles company when our state legalizes. Originally it was going to be 3 of us, each with a 1/3 stake in the company. I’m the chef, and not that business savvy. One friend, we’ll call him Josh, wants to bring his father and his best friend in as equal partners. He has convinced Alex, the other friend that this is a good idea by using the dad &amp; best friend’s finances as a lure. I’m finding this to be suspicious behavior because, it seems like Josh will effectively have power over 60% of the company if this is split equal ways with 5 people. We have investors, and I don’t find it necessary to have people with money become actual partners in the company. When I brought this up to Alex and Josh, they collectively try to convince me otherwise but I’m still not seeing their point of view. They have since tried to sweeten the deal for me by saying they’ll give me 25% and I’ll be the top shareholder. With the numbers they’ve thrown at me, Josh”s family will still control 55%. I’ve paid $2500 to our legal team to draw up the llc paperwork, and I’ve signed a legal services agreement. I have not signed any other paperwork. Can I just back out and wash my hands clean of this? Can I expect to lose out on my $2500? If I choose to go through with this, is there anything I can put in our paperwork that will prevent them from stealing my recipes and giving me the boot?\r\n\r\n\r\n\r\n\r\n---\r\nLocationBot 4.300172817 | GitHub (Coming Soon) | [Statistics](https://locationbot.info) | [Report Issues](https://www.reddit.com/r/locationbot)",
        "title": "I’ve paid a retainer to a lawyer to start an llc with 4 people and now I’m having second thoughts."
    },
    "a0om3s": {
        "desc": "Posting for my fiancé in Florida. \n\n40 hours of her vacation time can roll over to next year, however she still has 2 days left that need to be used this year. She submitted a request to her new boss for those days and was denied. There are no specific reasons they were denied, just that he will be in the office. He is only in the office when he has downtime, so it’s not a meeting or anything of importance. \n\nNo other days were suggested to take off and this is actually happening with more than one employee, not just my fiancé. \n\nDo they legally have to honor those vacation days in either taking half-days, an hour here and there or a straight payment? \n\n(",
        "subReddit": "legaladvice",
        "topComment": "That's going to be super-specific to her employment contract.  There are some general policies in Florida, but they're going to give deference to what she signed when she joined up.",
        "title": "Does an employer have to honor vacation days in either time off or reimbursement?"
    },
    "a0ly69": {
        "desc": "My credit union gives me 3% up to 15k as long as I have ~~5k~~  $500 of direct deposit and 15+ transactions every month. Is it worth it to put it all in there? The rest of my money is in a rainy day savings account that earns 1.5%.\n\nEdit: $500 not $5k\n\n\n",
        "subReddit": "personalfinance",
        "topComment": "Sure, up to $15k, as long as you do meet those requirements.\n\nGood luck.",
        "title": "[Saving] Should I put all my money in my checkings account that earns 3% APY?"
    },
    "a0n7vu": {
        "desc": "Hello! I'm in the US and my father has a 529 account with roughly 50 grand in it. He is going to pull it in January and has mentioned splitting it with me after he pays the taxes. Is this an option? Is it wise? What is the amount I should expect? Should I invest? I'm self employed (pass through) and work part time for publix in my off season. Thank you for any advice. ",
        "subReddit": "personalfinance",
        "topComment": "If anyone is planning to purchase education, you won't pay any taxes if you use the money from the 529 to pay for education.\n\nIf you don't use it for education, you will pay taxes.",
        "title": "What to do after cashing out 529 college fund?"
    },
    "a0pkbd": {
        "desc": "Had many fights with my father over long period. I finally had enough and told him, he told me where the door was, etc, etc.\n\nI have 100 dollars in cash, working part time, have a car with plenty of gas to go to work. No savings, only 1 friend who lives relatively close. I packed a few clothing items and some books along with my car phone charger.\n\nI can provide more details if need be, but basically I need advice and I need it sooner than later. I understand there's not easy answer here, I'm not excpecting one.\n\nWhat do you guys recommend? Currently sitting in a Barnes and Noble parking lot.",
        "subReddit": "personalfinance",
        "topComment": "Join the Air Force. Hardly any front line fighting. You can take college classes while you are in and can finish up should you decide to get out. GI Bill for college and GI benefits for buying your 1st home later. Possible travel to see the world. ",
        "title": "Kicked out of house."
    },
    "a0pmn4": {
        "desc": "I posted something earlier today and I was encouraged by the replies and interaction on my post. My friend asked me to post a question on here for her. Her question is, as a 15F, can she sext her 16M boyfriend? They both have agreed not to expose these pictures and are consenting to this exchange of photos. NYC. Thanks! ",
        "subReddit": "legaladvice",
        "topComment": "Child porn.\n\nSeriously, just don’t.",
        "title": "Posting on behalf of a friend: Is sexting okay?"
    },
    "a0jsac": {
        "desc": "Am thinking of switching my auto insurance that is up for renewal soon.  I've already prepaid the new policy with current provider on my credit card, in full for 6 month, but it hasn't started yet.    I know if I switch providers and cancel with them, they'll refund it.  Will they generally issue the refund back to the credit card or issue a check for the balance on cancelation? \n\nI'm potentially switching from Allstate -> Geico, in case anyone has done this with Allstate and knows.",
        "subReddit": "personalfinance",
        "topComment": "Back to your most recent form of payment.",
        "title": "Switching auto insurance near renewal, how will prepayment be refunded?"
    },
    "a0pr86": {
        "desc": "Reposting to add clarity:\n\n&#x200B;\n\nHell everyone, I am writing this on the behalf of my spouse. She currently works as a Recruitment Specialist for a home health company located in Ontario Canada. She is also 37 weeks preganant and is due mid December.\n\n&#x200B;\n\nBack in July of this year, all staff were given raises to align with new standards for the entire organization. Due to seniority and differences in wages, not everyone received the same increase. Her salary had increased from $46k/year to $55k/year. She later had a meeting with the Operations Manager (around August 2018) to discuss the increase in her salary (operations met with all employees weeks after increases were given). During this meeting her new salary ($55k/year) was confirmed by the Operations Manager however she did not receive any documentation; the Operations Manager had indicated that documentation would be given to all employees upon the return their District Director (Director was on vacation). She has been receiving paychecks at this salary for the past 4 months. \n\n&#x200B;\n\nToday she had a meeting with the Regional Human Resources Generalist and the new District Director. During this meeting they had indicated that payroll had made a clerical error and her salary was incorrect; she should have been receiving $47K/year instead of $55k/year. She had been receiving this salary for the past 4 months and they are now asking that she repay the difference (currently owes $3200). She was given the option to begin repayment once her maternity leave was complete and had returned to work. She told them that she would think about it and send an email confirming her decision as to when to commence repayment.\n\n&#x200B;\n\nShe had sent an email an earlier this evening to the HRG confirming she will gladly commence repayment once her maternity leave has come to an end and is back to work. The HRG responded shortly after indicating they had made an error and the option to start repayment after her maternity leave is no longer on the table; she will need to commence repayments starting her next pay.\n\n&#x200B;\n\nThis will unfortunately cause undue financial harship on our family and I am looking for help as to what our options are from a legal perspective. I feel as though she had done everything correctly and since her salary was confirmed by the Operations Manager then she should be allowed greater right or benefit and they should not be reducing her salary or requesting repayment. Even though she does not have anything in writing, we do have witnesses to the fact that the Operations Manager met with all employees to discuss their increase in salary in August and her salary was confirmed at that time. We have since created a new budget based on her new salary. I am far from knowledgable in this regard so I am looking to this wonderful community for some guidance.",
        "subReddit": "legaladvice",
        "topComment": "They cannot make her pay this back. This wasn’t an error in accounting that resulted in her being paid more than she was told she would be paid. This was then agreeing to pay her the wrong rate. They can immediately cut her pay down to $47k now, heck they could even reduce her down below unless it violates a union contract, but they cannot force her to pay this back.",
        "title": "Employer requesting repayment for wage overpayment"
    },
    "a0mvrx": {
        "desc": "Hi, I need some help. I got this letter in the mail about my taxes, and I have no idea what it means (I removed any of my personal information).\n\nHere it is: [Photo](https://imgur.com/a/LhwWmUL)\n\nThanks in advance. It's probably something really simple...",
        "subReddit": "personalfinance",
        "topComment": "They're saying you over reported your tax credits somehow. Since this isn't your whole return we can't see which ones specifically they changed but something was flagged on their end. ",
        "title": "Tax Letter Makes No Sense"
    },
    "a0ofld": {
        "desc": "I (21, F) have a credit score of 781, but only one credit card to my name, no other major loans, (student, auto, etc. I paid cash for my car and sold it for the same when I was done with it.) I applied for another card a while back that doesn’t charge international fees (because I’m blessed with the ability to travel somewhat frequently) but got turned down for lack of credit. \n\nI was thinking about getting a Target red card just for the sake of opening another low-maintenance card.  Where I am in the city is sort of food-locked, so I end up buying most of my groceries, pharmaceutical needs and household supplies at Target. Again, I don’t ever anticipate a purchase there that would put me in even remote danger of needing to only pay the minimal payment and getting hit with their 24.65% Variable APR, because I make all these purchases off of my debit card already. Is the 5% off purchase worth it? Should I get a RED debit card and look into some other credit building opportunities?\n\nAny advice is appreciated!",
        "subReddit": "personalfinance",
        "topComment": "Target CC has a setting on it to autopay every month. I use it whenever I’m at target and get the 5% and it never has a balance so I never pay them any interest. Be sure when you buy you can pay when they autopay. I also do this on my Amazon/Chase card. Like any CC you have to have discipline to not pay the rich corporate fat guy interest  \n\nNote that Target also has a debit card that takes money out of your debit card at the time of transaction and you still get 5% but it’s not a CC and won’t do anything for credit \n\n",
        "title": "are store cards a decent way to build credit?"
    },
    "a0psmf": {
        "desc": "My husband is the executor of his uncle’s estate, as my husband is the next and last of kin. As we were going over uncle’s accounts once uncle passed away, we were surprised to discover over $17k worth of charges spread over his checking and a few credit cards. I called around and quickly found out that a cousin had used those cards while he was dying in a nursing home and she continued briefly after he died, until we closed everything. She took a road trip across the country and placed charges in dozens of cities and several states. We have pressed charges in one city in which she made a big chunk of charges, but what else can we do? One credit card company will not refund the charges ($4k air bnb) because the account was closed upon uncle’s death and they can’t retroacfively open a fraud claim. We’ve been told that we could contact each individual city in which she used the cards to press charges but it was hard enough just to file in one city. Is there anything else we can do? We have an estate lawyer but he was pretty clueless about this other than suggesting we let the credit card company open a claim for the unpaid balance and we can counter as fraud. Tldr; My husband’s cousin is a terrible person who stole her dying great uncle’s wallet and now we’re paying for her crime. (FL)",
        "subReddit": "legaladvice",
        "topComment": "---\r\n> http://imgur.com/a/myIAb\r\n\r\n---\r\n*I am a bot whose sole purpose is to improve the timeliness and accuracy of responses in this subreddit.*\r\n\r\n---\r\n**It appears you forgot to include your location in the title or body of your post. Please update the body of your original post to include this information.**\r\n\r\n---\r\n***Do NOT delete this post - Instead, simply edit the post with the requested information.***\r\n\r\n---\r\n\r\nAuthor: /u/madameleota2\r\n\r\nTitle: **Cousin stole money from dying uncle**\r\n\r\nOriginal Post: \r\n\r\n> My husband is the executor of his uncle’s estate, as my husband is the next and last of kin. As we were going over uncle’s accounts once uncle passed away, we were surprised to discover over $17k worth of charges spread over his checking and a few credit cards. I called around and quickly found out that a cousin had used those cards while he was dying in a nursing home and she continued briefly after he died, until we closed everything. She took a road trip across the country and placed charges in dozens of cities and several states. We have pressed charges in one city in which she made a big chunk of charges, but what else can we do? One credit card company will not refund the charges ($4k air bnb) because the account was closed upon uncle’s death and they can’t retroacfively open a fraud claim. We’ve been told that we could contact each individual city in which she used the cards to press charges but it was hard enough just to file in one city. Is there anything else we can do? We have an estate lawyer but he was pretty clueless about this other than suggesting we let the credit card company open a claim for the unpaid balance and we can counter as fraud. Tldr; My husband’s cousin is a terrible person who stole her dying great uncle’s wallet and now we’re paying for her crime. \r\n\r\n\r\n\r\n\r\n---\r\nLocationBot 4.300172817 | GitHub (Coming Soon) | [Statistics](https://locationbot.info) | [Report Issues](https://www.reddit.com/r/locationbot)",
        "title": "Cousin stole money from dying uncle"
    }
}