{
    "9xu6k6": {
        "desc": "This fuckup took place this very evening. I don't need no throwaway.\n\nSo, here I am, a horrifically anxious 26 year old virgin who wants to enter the dating scene. At this point my complete lack of experience is something that I'm highly self conscious about. Sex has never been a priority of mine, but I'm thinking it's time that I learn a thing or two, try to develop some confidence before I really put myself out there.\n\nWhat does one do to get some experience? Hire a prostitute. Duh. \n\nI researched the shit out of this before I settled on an escort that I wanted to move forward with. This did not save me, reddit. I arrived at the hotel and was greeted by definitely not the girl from the pictures. I told myself all day long that if this happened I would simply leave. So of course I went in. \n\nThere I stood, knowing full well that I wasn't very attracted to this woman. She was Asian, which I like, but she was also older, and spoke VERY little English, which I didn't like. So of course I paid her.\n\nShe makes me undress first. I'm committed. She takes her robe off annnnnnnd FUCK. Out of shape, TONS of bush, (not hating just not my thing) really just all around not the type of woman I would have preferred to have this experience with. So of course I got into the bed.\n\nAn attempt was made. Wood could not be sustained. Between me not being into her and my anxiety driving me deep inside my brain, this just wasn't gonna happen. First she tried oral through a condom. Then she tried to ride me. I was inside for about 2 seconds before my dick just went \"NAW.\" In a final effort, she gave me a handjob. The handjob almost worked, likely because I was trying reeeal hard to picture myself in another place with another person. She was clearly making a real effort. It was awkward, guys and girls. Towards the end she was looking visibly frustrated and I thought to myself \"boy I'm really making her work for this, I don't think either of us are having fun.\" Then my dick noped out again.\n\nI got my shit and I left. RIP my time, my money, and my potential happiness where this night is concerned. I'm choosing not to count those 2 seconds of penetration as a virginity killer, because no... Just no.\n\nTL;DR: Tried to lose my virginity to an escort, did all the things I shouldn't have done, didn't get off, all around shit experience.\n\nEdit: Well thank you reddit, most of these comments are surprisingly supportive. I'd just like to say that I'm not going to overthink this. Sex isn't ruined for me or anything, this was a learning experience and the lesson won't be forgotten any time soon. I was hoping I could power through my first time and maybe learn a thing or two but clearly I'm not wired for such an experience. \n\nAnd to the few calling me a judgmental asshole... Wat? I had an understanding of who I was going to see, and she ended up not being that person. I don't think being disappointed with her being different in every way from what I was expecting, especially after taking my time to try to find the right person, makes me an asshole. If you want to judge me for anything, I'd think it would be for being dumb enough to go in despite being lied to.\n\nAnd lastly, yes, I know that it technically counts, and my v-card is riperoni.",
        "subReddit": "tifu",
        "topComment": "I feel kinda sorry after reading this. \n\nThough I want to tell you...sex is not always super hot, sexy, mind blowing and satisfying as hell. Sometimes it's awkward, wrong or strange at least. Sometimes 2 people just lack physical chemistry and you don't know or don't want to believe beforehand. I think most of us have been at this point for at least one time in their lives (I was there a lot).\n\nSo please try not to overrate this. I would also guess that the majority of first experiences was rather on the negative site of things.\n\n&#x200B;\n\nTry to move on and forget about it. Good luck for the next try.",
        "title": "TIFU by trying to lose my virginity (nsfw)"
    },
    "a035xe": {
        "desc": "Want to hear a story from my life? This happened about two hours ago and I'm still reeling. \n  \nSo I was eating a delicious crepe with a plastic fork and knife at work, and I slid the fork into my mouth, go to slide it out and -  \n  \nNothing.  \n    \nNo movement. It got stuck in my lower palate. It's hard to describe, but it's wedged firmly under my teeth - not in my flesh, but the way my teeth are oriented, they're slightly tilted inwards. So it's stuck horizontally, right along the gumline, literally wedged in there.  \n  \nHave you ever done something and iMMEDIATELY realize \"...oh I fucked up.\"  It's a VERY specific feeling - you know the one. A weird sinking feeling in your insides. My entire body froze and all I can think is \"I AM FUCKED. UPWARDLY.\"  \n  \nThere was still a huge bite of food on my fork, and I'm at the register, so I do the only thing I can think of and I sit down on the floor behind the counter. I'm fuckin salivating everywhere because I CAN'T SWALLOW re: fork wedged ENTIRELY in my mouth, so I reach my hand in and scoop the food out like an animal and throw it in the trash, all while crouched on the floor like some sort of feral child.  \n  \nI start to hyperventilate.  \n  \nI start panicking about urgent care bills.  \n  \nI imagine having to call a fuckin ambulance for THIS shit.  \n  \nI convince myself to breath deeply and slowly. It's really only been 45 seconds or so, but it feels like an eternity. This is my life now. This is my destiny. But I resolve to fix this situation in the bathroom, so I stand up and type out in the search bar of the computer to my coworker \"I have a fork wedged in my lower palate and can't get it out brb.\"\nHe looks at me, utterly bewildered, as I scurry off to the bathroom with my hand covering my mouth, the handle of the fork sticking out four or five inches. As I try to rotate the bastard while walking  \n  \nPAIN  \n  \nI try to push it further in\n  \nI start to gag because it's so close to my gag reflexy bits. I get to the bathroom and I'mf uckin heavy breathing, and I can only assume at this point there's just so much saliva it lubricates this bitch JUST enough to loosen it and I shove it BACK, stab myself in the tonsil or some shit, but I am free. \n  \nNow my teeth hurt and I'm super embarassed but I didn't fuckin die so there's that\n  \n\ntl;dr rammed a fork into my mouth, nearly choked to death, drooled all over the register, felt shame. ",
        "subReddit": "tifu",
        "topComment": "LMAO, good, quick thinking, I would have crepe'd myself in terror.",
        "title": "TIFU by aggressively eating a crepe"
    },
    "9z05k2": {
        "desc": "TIFU by making nearly every possible mistake while cleaning my PC, possibly damaging it.\n\n(This actually happened a few days ago.)\n\nThe rear exhaust fan on my PC hadn't been turning, so I decided to use compressed air to clean it and the rest of the interior.\n\nA few days after cleaning it, I was using my computer normally when the entire office lost power. Something had tripped the breaker for the room, and though my ceiling fan was also on, I figured the culprit was probably the computer. I shined a flashlight in the case, and things looked fine from what I could see, though I couldn't get a good look at the power supply.\n\nI only just discovered that I had made nearly every mistake possible:\n\n* I didn't unplug the power supply from the surge protector prior to cleaning the case, which was probably the worst mistake I could have made. \n* I didn't move the computer from its usual spot at the corner of the room, so dust probably just circulated right back in. \n* Because I only opened one side of the case, it was awkward reaching certain spots I wanted to clean, so I probably ended up blowing a lot of dust back into the components.\n* I didn't hold the fans still while blowing compressed air at them, risking damage to fragile fan blades from spinning too rapidly.\n* I shook the can of compressed air.\n\nI did wear my antistatic wristband, though. Yay? \n\nI'm too terrified to plug it into a working outlet to find out if it will even turn on.\n\nTL;DR I made a number of stupid mistakes while trying to clean my PC and it tripped the breaker in my office, possibly getting damaged in the process.",
        "subReddit": "tifu",
        "topComment": "These are not terrible mistakes imo except shaking the can of air. \n\nI genuinely would not worry and you 100% did not cause your office to lose power from cleaning your PC with can air. ",
        "title": "TIFU by making near every possible mistake while trying to clean my PC, possibly damaging it."
    },
    "9zuxm8": {
        "desc": "So naturally this happened a couple nights ago.\n\nTypically the Wednesday before is one of the biggest drinking nights of the year. As per usual I was planning on getting wasted and deal with the hangover with some good turkey and explaining to my extended family why the Cowboys and Lions always play on Thanksgiving. Someone always asks. I swear they are just fucking with me at this point.\n\nANYWAYS we went to this one bar that was pretty social. I was about half beer away from the point of no return and it was late into the night. We were our together with my girlfriend of 3 years and some of our old college friends. \n\nSince I was so wasted I was basically put into a corner of the bar near a window as to avoid drinking more or fucking something up. There was what I thought at the time a plant that looked like a fake cactus in the window. I played with it with while my more responsible friends were saying their goodbyes before last call. I don't know how long I was petting this cactus but it had to be at least 10 minutes.\n\nWe get an uber home and I start to sober up because the girlfriend is getting frisky. She was a bit drunk but no where near the level I was. We get a right to it in the bedroom and I started with some foreplay before fingering her. She was into it like normal when all of a sudden she started screaming in pain.\n\nI pulled out quickly(bad idea) and she asked if I had just cut my nails today. I said no and she says she thinks I cut her. We turn on the lights and as it turns out the cactus was real I had a few prickly spines in my finger. Most of the rest were in her. She spent a good 3 hours in the bathroom getting them all out. Because of this she couldn't sit down without feeling pain for the whole day and had to eat while standing in front of the family. It's been a couple days and I'm wondering if she's gonna break up with me out of sheer embarrassment because of my stupidity.\n\nTL:DR, pet a cactus at the bar, got a bunch of spines on my fingers and didn't notice until I fingered my girlfriend. She had to stand during Thanksgiving.",
        "subReddit": "tifu",
        "topComment": "So why do the cowboys and lions play every year?",
        "title": "TIFU by putting cactus spines into my girlfriend's vagina before Thanksgiving"
    },
    "9zqnbe": {
        "desc": "This one happened about 16years ago.  I was a young doctor whose work uniform was OR scrubs.  This is important later.\n\nIt was the first sunny day of spring and I had taken equally young nurse on a long motorcycle ride.  We weren’t really dating, but it had the potential to head that way.\n\nIt was sunny out and I was in short sleeves.  It was the first sun my arms had seen after a long and dark winter.  I have dark hair and ruddy skin but still manage to sunburn easily and I didn’t have any sunscreen on.  Neither did she, but she didn’t sunburn.\n\nI sunburned quite badly and in a ridiculous pattern.  Where my arms were outstretched to the handlebars, the tops of my arms turned a bright, hideous red.  The sides of my arms remained ghostly pale.  It look as if someone had painted my arm with bright red paint after doing some particularly meticulous work with masking tape.\n\nAs I mentioned above, I wear short-sleeved scrubs in the operating room and couldn’t hide that particularly hideous and odd sunburn. \n\nAnd that’s when I was struck by possibly the worst idea a man has ever had.  It occurred to me that I could buy self-tanner cream and blend and hide the sunburn with that.  I ran by the pharmacy and sure enough, they not only had “Banana Boat Brand Self-Tanning Cream” but it was on sale two for one!\n\nI brought it home, and as a man of science and a high scorer on standardized tests, decide that a man of my immense intelligence didn’t need to read the instructions for a product targeted at lesser intellects.  So I didn’t.\n\nI went into the bathroom and carefully applied it to all my exposed skin as though I was putting on sunscreen for a day on the beach.  “Better do my face too!  It needs to match my tanned arms….”  I looked in the mirror and my skin didn’t appear any darker and my sunburned arms still glowed like a fresh and particularly ill-advised tattoo. \n\n“No wonder this stuff was on sale 2-for-1.  It doesn’t work.”  So I applied the second bottle even more heavily and looked in the mirror.  “Maybe it’s a little darker, but pretty unimpressive stuff.”  Then I went to bed as I had an early work day the next morning.\n\nHere’s something I didn’t know, that I might have picked up if I had bothered to read the directions.  It turns out that self-tanning cream reacts with the top layer of your skin, absorbing it and slowly darkening via a chemical reaction that occurs more strongly wherever your skin is thickest and deadest.  Places like the palms of your hands (that you might use to apply it) as well as your ears and elbows.  \n\nIt turns out they tell you this on the bottle, on the back, and warn of the importance of washing the tanning lotion off your hands before it can react and being meticulous in in applying it evenly and smoothly.  You know, just like busy, arrogant, young guys do….\n\nI woke up the next morning, went to brush my teeth and was met with 6’5” Oompa Loompa with leprosy staring back at me.  “No problem,” I thought “I’ll just wash off in the shower” not yet realizing that it wasn’t on my skin, it was IN my skin.\n\nOne thing about healthcare.  You don’t call in sick for anything that’s not life-threatening.  It shouldn't be that way, but it is.  You sure don’t call in sick for a tanning cream misapplication.  You have patients and medical partners, and other doctors counting on you.  So I went in.\n\nIf a pit to hell had opened up in front of me, I would have gladly jumped in.  My nurse friend also worked in the Recovery Room and every time she and the other nurses saw me, they erupted in laughter.   To make matters worse, I usually teased her and the other nurses mercilessly and there was no hiding this humiliation.  At one point my friend squealed in sheer joy and stamped her feet and announced to the world that “This is the best day ever!!”  \n\nI eventually realized that coarse gauze and a solution used to remove “Dura-Prep” and a lot of hard scrubbing would remove the dead skin the self tanner had stained dark splotchy walnut brown.  I spent every spare moment scrubbing my face and elbows and sunburned arms - and at an age far later than you might have expected, finallylearned to read instructions.\n\ntl:dr Applied self tanner without reading instructions.  Humiliated myself at work.",
        "subReddit": "tifu",
        "topComment": "This is the best day ever! Haha ",
        "title": "TIFU by not reading the instructions on self-tanner lotion"
    },
    "9yoovg": {
        "desc": "Sorry for format problems I'm typing this on mobile. This actually happened about 6 hours ago and this is a throwaway for soon to be obvious reasons. Sorry for the long lead up. \n\nI woke up around 12pm after 5ish hours of sleep to go to a job interview. I was rushing out and there was no chance to get breakfast (First fuck up). Ive been broke for the last 3 days and the shelter I live in has assigned times, which I missed, to get meals. \n\nSkip forward 2 hours and I got a half of weed after picking up my check today in the city. I had the day off of work and randomly decided to go see the new Fantastic Beasts movie extremely stoned.  I rolled up two SUPER FAT joints with a tiny bit of newport cigarette (Fuck up #2) before I left. \n\nI was going to smoke and go grab a few slices from my fav pizza shop on the other side of the bridge but that didn't work out. I kept checking the ticket prices in Manhattan fucking $24! In the Bronx? $13. I had planned on going to the city to smoke comfortably after I ate originally but im not good with sticking to plans. Also the movie time for the cheaper show is pretty close but it starts in like an hour. Id get there just in time but the area is full of like.. So many cops. Throws off my whole plan of getting stoned outside and walking into the theater blazed.. So what does my dumb ass do reddit?\n\nI smoked both the joints back to back. In retrospect, I probably could have made better choices. The other showing was 6hrs later for that price and I wouldn't be able to catch that one. So I started speed walking to the train station while chain smoking these two huge joints. I was literally RIGHT ACROSS THE STREET FROM THE PIZZA SHOP but by that point I was just so stoned and made up my mind to \"catch the early movie asap\".\n\nThe ultimate fuck up and climax of this story truly begins with me smoking that damn cigarette instead of grabbing a slice. I smoked an entire cig and proceeded to run up 2 flights of steps to catch the train. It's like 5ish, rush hour. The train is super packed and there's no air flowing. I'm heading a few stops downtown to transfer. There are ZERO seats. I stand for like 15 minutes not playing music on my headphones. Squeezed between people and I just start feeling dizzy. Not like sick or nauseas. Like when you spin around alot but subtly. Anyways..\n\nI just deal with it for a few stops and finally get off. Guess what? Another flight of stairs to transfer. I get to the top as the train is pulling up and there's this little store with all the candy and chips etc. I run up and ask how much for the raisin cookies. He says $1 and I grabbed the cookies and ran to the train. People are stuffing into the train AGAIN but luckily I have cookies and its only 3 stops. There's 2 cookies in the pack and I rip it open and start stuffing them in my mouth. I haven't eaten in like 16hrs so im going at it and i dont wanna try eating on the train cuz im still busy. I didn't realize the cookies tasted off. I smash myself into the train with other people and some stroller. I'm standing with my back against the door. Its ANOTHER train car with no air and im starting to feel more and more faint. Train starts moving sllloooowwwwllly. \n\nI look down at the wrapper and realize it's peanut butter cookies. I'm uncomfortably allergic to peanuts. I hadn't really swallowed much as I had stuffed both cookies in my mouth and chipmunk chewed them. I instantly spin to the right and spit the whole clump of chewed wet/powdery cookies out onto what I thought was the floor. It wasn't the floor. It was all over the fucking toddlers lap and hair. The woman yelled something but idk what. I'm still soo high but soo dizzy and my mouth just feels so dry. I leaned over to try to offer tissues from my bag and my vision just goes black within seconds. It's like this mute hum and it's all fucking disorienting. Train is shaking around and I slam into this lady and almost pushed over her stroller. She shoves me and starts slapping/hitting me in the face thinking I'm being an asshole. All these people are pushing me around. I'm feeling worse and worse. Lots of muted yelling. I'm literally blind at this point. The kid is crying. After what felt like eons but was really like a minute I feel the wind coming from the train door and I knew it opened. I just shoved my way that direction and made my way out of the train full of angry people. Idk how I found the railing without sight but I did and I clutched it sitting there for like 5 minutes. Nobody got off the train from the angry cart to yell at me. I guess they thought I was just crazy... My vision started to clear up slowly and my hearing came back too. Idk what that was but it was terrifying. Once i felt \"better\" I stumbled downstairs to the bodega and ordered a cheeseburger w/fries forcing myself to eat standing up. I felt so much better in like 15 minutes. I ended up throwing away the rest of my cigs & taking a short cab to the movies just to not have it all be pointless. \n\nI realize now that though it's kinda shitty where my spit out death cookies landed, if I'd have eaten them that would have been the worst time to have my throat close up. I'm not DEATHLY allergic but two PB cookies would definitely be pushing it severely. I'm really sorry to everyone on the train that had to deal with me during that episode. Luckily I'm not really \"hurt\" physically, but just that whole moment of going blind has me really shaken so idk if this counts as a real fuck up. \n\n\nTLDR : tifu by not eating for almost 16 hours before smoking two really strong fat joints back to back while speed walking to the train and smoking a cig instead of getting food. Instead of pizza, I accidentally grab cookies im allergic to from a train station bodega and proceed to spit it on a toddler while going blind and getting beat up by the mom before regaining my vision\n\n\n\nEdit:  I'l might as well have died last night if I knew y'all were gonna murder me in the comments lol. Just wanted to clarify a few things since my bad decisions somehow blew up. I'm not saying it makes this any better, just adds perspective. \n\n1. I have 2 part time jobs already and ive been looking for a 3rd more consistent job with higher pay for the last month. Hence the interview.\n\n2. I actually have a savings. I made alot of dumb decisions in the past (obviously) and used to have a bad drinking habit. I stopped 6 months ago and started smoking instead. I save my money via money orders so theres no way for me to spend my money without me cashing it, which I wont. I set aside a specific amount for weed a week which is VERY cheap for me about $50 and i try to put the majority into savings and eat at work/shelter.\n\n3. It's not funded by taxpayers, its a private shelter. So y'all not paying for my dumb ass don't worry lol. It took alot for me to even get here. Before this I was couch hopping for months thinking i could save up while drinking and I wasnt. So i stopped and came here. My only goal is to be a better person. I fucked up yesterday and alot of other times but don't think I'm some crusty bumming off the system. I work really hard to try to make a better life for myself, I just wanted to see a goddamn movie so...\n\n4. The movie wasn't worth it and JK Rowling owes me $13.50. I have is my movie ticket which might still be in my bag. I'll check later.\n\n5. The cab cost me $7. Stop getting on my ass about that please. \n\nEdit #2: In regards to all the comments about me choosing \"drugs\" over food. I was trying not to make my already long post even longer with tmi. I ate the night before but stayed up really late sending out emails and adjusting my schedule for the week so i could sleep in and go get my check. \n\nWhen I did get my check I decided to get pizza and go see my dealer but he was leaving soon for the day and close to the pizza shop so I went to him first. I guess that was my first REAL fuck up. It wasn't until after that I got there did he bring up the movie and I decided to go see it stoned. I rolled up in his house because it was safer. So pls stop making assumptions. People are also getting political for no reason? Good lord. It really wasn't that serious except for the lady cuz I fucked her day up and deserve that ass kicking but IT WAS AN ACCIDENT. I feel like because I live in a shelter people are demonizing me. There's alot of really great and hard working dudes in my dorm just trying to save up like me. We're not some hoodrat degenerates stealing your tax dollars. \n\nIn regards to people saying I assaulted a child? I spit cookie onto his lap and flecks of it got in his hair. It wasn't that serious. The only reason I even bumped into them afterwards was because the train shifted and my vision was going black. She probably wouldn't have reacted the same if I hadn't done that with the cookie but either way I've said from the beginning I felt really bad about the entire thing. I was stoned and i realized i ate the cookies and i just freaked i wasn't thinking who was where. After that things went downhill. Sorry for the SUPER LONG post I was trying to avoid. ",
        "subReddit": "tifu",
        "topComment": "Lol dude you made so many bad decisions in such a short amount of time. \n\n\nEdit: Not trying to shame the dude. Honestly this is probably the most honest to god New York TIFU I've ever read & its hilarious, I also feel bad. Some of these comments are ridiculous OP, you're not some bad guy. Since I'm top comment I'll try to TL;DR everything & the edits in OPs post with timeline & facts.\n\nOP has 2 jobs. OP applies to a better job. Nothing is really stated as to what OP does before getting home but assuming he gets home late and eats food before 12am.\n\n\n**10pm-12am:** Gets home & Eats Food.    \n\n\n**12am-7ish:** Stays up working on schedule and important things.    \n\n\n**8am-12pm:** OP sleeps and then wakes up for interview. Also skips breakfast or lunch. (**Key Plot Point**)     \n\n\n**12pm-2pm:** OP gets paid, puts money in savings, leaves to buy marijuana before getting food because dealer is leaving soon.     \n\n\n**2pm-4pm**: Travelling?    \n\n\n**4pm-5ish:** Gets to dealer. Decides to see movie (**Key Plot Point**). Rolls up weed at dealers house in safe enviroment and heads out to the movies.         \n\n\n**5:30:** OP initially plans to get pizza before going to movie but checks movie times/prices, see's the cheaper ticket is closer, trying to be $$ conscious on his fun day off. Realizes the area with the best price is full of police so he cannot smoke outdoors safetly. In a panic he smokes two joints instead of saving one for right before the movie and one right after. (**Key Plot Point**)     \n\n  \n\n\n**5:30pm-6pm:** Between that time OP gets to the the train and because he's stoned & rushing, decides to not get pizza. Instead he smokes a cigarette expecting to eat while there, complaining about the steps and feeling dizzy.     \n\n\n\n**(Important Note) At this point I'd like to point out the things OP complained about. Blurry vision, going blind, dull hearing, dizzyness, walking up the steps alot. After a quick google search of his symptoms, I checked other comments to see if anyone agreed. I'm sure OP's blood sugar dropped dangerously low because they didn't eat. Smoking did not help. Shoulda got the pizza.**      \n\n\n\n**6pmish:** OP experiences those symptoms listed above during rush hour on the NYC transit system. Realizes *\"I needs to eat something\"* but accidentally grabs cookies he's allergic to. Squishes into a train feeling faint and realizes he's eating essentially cookies that can kill him. Instantly turns away from the seat I'd assume was to the left if he stood by the doors and spits it all on some poor kids lap. OP reaches down into his bag (Mistake) to get tissues for the kid as his vision goes black on a moving train. He accidentally slams into the lady who by now thinks the cookie bit was on purpose. Gets beat up and slammed around by angry people who misinterpreted what's happening. OP runs off the train, gets his bearings, finally grabs a sandwich, and takes a cab.     \n\n\n\n**6:30ish-8:30** OP watches movie.    \n\n\n**8:30-10ish:** I'm assumimg OP makes this post in TIFU either on his way home or when he got there.     \n\n\n\n\n\n**That's the entire post in a nutshell. Hope it helps. I only did this because of the overwhelming amount of top comments judging this guy just because he lives in a shelter without knowing his life. Also OP, always make sure to eat 4-5 small meals a day. Its hard to remember to eat when you work alot, keep your glucose levels in check. Keep doing your best, ignore what all these judgy comments say. I'm rooting for you and stop doing dumb shit like that lol**\n\n\n",
        "title": "TIFU by randomly deciding to go see the new Fantastic Beasts movie which resulted in me nearly assassinating myself"
    },
    "a0p2ja": {
        "desc": "A couple years ago, I was sitting outside with my buddies just chilling out and drinking a few beers. Things were going normally. One of my buddies decided to get up and go take a shower. Myself and my other buddy just stayed outside and hung out. That was until his next door 83 year old neighbor comes over and asks us, \"Would any of you guys be able to help me get my kid out of the attic?\" I was instantly worried and of course I just had to get up and go help her look for this little kid who was stuck in the attic. My buddy who was with me didn't say a single word when she came out and didn't move from his chair.   \n\n\nWhen the old lady took me into the part of her house that had the attic, I realized that there was no way in hell I was going to be able to climb up there to grab her since there was no latter.  I did the only thing I thought I could do and I called the cops. So now we have a situation that has escalated from 2 guys sitting outside enjoying a few beers, to two police cruisers, an ambulance, and 2 fire trucks all rushing and cramming into this little alley of a neighborhood searching for this little girl. I counted that there were a total of 12 men who came into the house to look for her. One of the officers pulled me and the old lady aside to question us about what had happened, and I told him my side of the story. They then questioned the old lady about what had happened. She told them that she was looking for her daughter named Deborah. The officer then put his notebook away, and then pulled me aside again and said \"I'm going to go ahead and send these guys home. She's looking for her daughter Deborah; she's been dead since 1987.\" Obviously I was awestruck that this happened, and I thanked all of the police officers, fireman, and paramedics for their time and apologized to them. I didn't think the story could get any worse until I got back to my friend's place. There I see my buddy still sitting in his chair dying laughing. He finally regained his composure and then he said, \"You didn't find her did you?\" And then he busted out laughing. He knew the whole time what was going on and let me go and get all of those policemen, fireman, and paramedics for no reason. \n\ntl/dr:  I called the cops because I couldn't find a little girl that had been dead for almost 30 years.",
        "subReddit": "tifu",
        "topComment": "Your friend is a sack of shit for wasting first responders time.",
        "title": "TIFU by helping an old woman look for her young daughter who got stuck in the attic."
    },
    "a0i65k": {
        "desc": "**Welcome to the common fuck-ups megathread.** You [suggested it](https://redd.it/4ifanz), and [we listened](https://redd.it/4ir8p4). \n\n \n\nYou may be wondering what a \"common fuck-up\" is. Normally they are topics that are non-noteworthy or unoriginal, the minor things we fuck up. You can view them in our [[wiki]](/r/tifu/wiki/commonfuckups). While we are being lax on this rule within this thread, we want to remind everyone that every other rule still applies, which can be found on our sidebar or [[wiki/rules]](/r/tifu/w/rules) page. \n\n*We will be having 2 megathreads a week:* \n\n1. Monday-Friday for normal common fuck-ups\n2. Friday-Sunday for nfsw (rule 4) common fuck-ups\n\n---\nwiki pages: / [*detailed rules page*](/r/tifu/wiki/rules) / [*sidebar link*](/r/tifu/about/sidebar) / [*list of common fuck-ups*](/r/tifu/wiki/commonfuckups) / [*flair/NFSW filters*](/r/tifu/wiki/flairs) / [*rules(report reasons)*](/r/tifu/about/rules) / [*FUOTW archive*](/r/tifu/wiki/index) / [*other subs*](/r/tifu/wiki/subs) /",
        "subReddit": "tifu",
        "topComment": "Let’s start with how you deleted that marble post...",
        "title": "Common Fuck-Ups Megathread - November 26, 2018"
    },
    "9y0z25": {
        "desc": "I have always been bad with standardized tests, so when I moved to America and the SATs was a requirement to get into Uni, I bombed it and ended up at a lower-tier school. I graduated with honors.\n\nWhen it came time to pursue my Masters, I saw that pretty much all the schools required you take the GREs and was flooded with traumatic flashbacks. So I went abroad and graduated with first class honors. I came back to the states with tens of thousands of dollars in debt and couldn't find a job in my field. So now I've had a string of level-entry desk jobs since I've been back (4 years).\n\nNow I thought, great! I'm ready to pursue my PhD, finally! What do you need to pursue a PhD? Why, a Masters degree of course! And some references, some writing samples and... oh.... ah shit. GRE scores. (Which doesn't make a lot of sense because it's not like they ask for your SAT scores when you're applying for a Masters program, so wtf...)\n\nI could've sworn it didn't used to be a requirement for PhDs in the states. This throws a wrench in my whole plan.\n\nTL;DR, I thought I could pursue my Masters and PhD and avoid the GREs by getting my Masters internationally, but it's still a requirement for PhD. Which is stupid.",
        "subReddit": "tifu",
        "topComment": "US PhD programs generally require students to take coursework (for which they often receive a Masters) before writing their dissertation.  You don't have to have a Masters to apply for a PhD program - most people don't.  So in this case, it's not quite like a grad school asking for your SATs.  \n\nStill sucks, though. Sorry you fucked up. ",
        "title": "TIFU by thinking I could bypass taking the GREs for my PhD by doing my Masters internationally."
    }
}